
var slideIndex = 1; //משתנה גלובלי האחראי לאיתור מספר התמונה הנוכחית. בתחילה יהיה שווה 1 ולכן בטעינת העמוד תוצג התמונה הראשונה 

function initSliders() { // קריאה לפונקציה כאשר הבאדי נטען - אחראית להציג את התמונה הראשונה בגלריה כתמונה הגדולה 
    showSlides(slideIndex); // קריאה לפונקציה שאחראית להצגת התמונות וההנפשות בהתאם לתמונה הראשונה
}

function plusSlides(n) { // פונקציה שמופעלת בלחיצה על כפתור החצים ומשנה בהתאם את מיקום התמונה
    showSlides(slideIndex += n); // מספר התמונה שתוצג תשתנה בהתאם לחץ שנלחץ
    //  במקרה של לחיצה על חץ ימינה - מוסיפה 1 למשתנה שסופר את מספר התמונה המוצגת, ובלחיצה על חץ שמאלה - מחסירה 1 מהמשתנה של מספר התמונה המוצגת
} 


function currentSlide(n) { // פונקציית שפועלת בלחיצה על אחת מהתמונות הממוזערות בתפריט התמונות
    showSlides(slideIndex = n); // קריאה לפונקציה להצגת התמונות וההנפשות לפי מספר התמונה הנבחרת
}

function showSlides(n) { //  פונקציה שאחראית להצגת התמונה הגדולה וההנפשות בתפריט התמונות הקטנות - מופעלת על ידי שאר הפונקציות

    var slides = document.getElementsByClassName("mySlides"); //מערך שיש בתוכו את התמונות הגדולות, כל אחת מהן בתא נפרד במערך
    var dots = document.getElementsByClassName("demo"); //מערך שיש בתוכו את התמונות הקטנות, כל אחת מהן בתא נפרד במערך
    var captionText = document.getElementById("caption"); // משתנה שאחראי על האלמנט שבו יוצג הטקסט - כותרת התמונה
    if (n > slides.length) { // אפ אורך המערך גדול יותר ממספר התמונה
        //   כלומר, אם אורך המערך הוא 6, ומספר התמונה גדול יותר מ6
        // אם המשתמש לוחץ על חץ ימינה כאשר הוא נמצא בתמונה השישית 
        slideIndex = 1; // הצג את התמונה הראשונה כתמונה הגדולה
    } // בדיקה אם המספר גדול ממספר התמונות, אז המספר יחזור לתמונה הראשונה
    if (n < 1) { // אם מיקום התמונה קטן יותר מ-1. כלומר אם המשתמש נמצא בתמונה הראשונה ולוחץ חץ שמאלה, כלומר אחורה
        slideIndex = slides.length; // התמונה הגדולה שתוצג לו תהיה התמונה ה-6 , לפי אורך המערך של התמונות הגדולות
    }
    var index; // משתנה שמייצג את המיקום במערך עליו עוברים בלולאה
    //לולאה שאחראית להסתיר את כל התמונות הגדולות, על מנת שהמשך נוכל להציג רק תמונה אחת
    for (index = 0; index < slides.length; index++) { // לולאה שרצה מ0-5, עד אורך המערך פחות 1 של התמונות הגדולות      
        slides[index].style.display = "none"; //  מסתיר את הסליידר במיקום האינדקס
    }
    //  לולאה שאחראית לטשטש את כל התמונות הקטנות, על מנת שבהמשך נוכל להציג ללא טשטוש את התמונה המוצגת 
    for (index = 0; index < dots.length; index++) { // לולאה שרצה מ0-5, עד אורך המערך פחות 1 של התמונות הקטנות
        dots[index].className = dots[index].className.replace(" active", ""); 
    } //  cssבכל סיבוב של הלולאה היא מוחקת את הקלאס אקטיב מהתמונות הקטנות שבתפריט ומחליפה אותם בקלאס ריק, על מנת להשפיע בהמשך על העיצוב של התמונה המוצגת / נבחרת - בעזרת העיצוב של ה 

    slides[slideIndex - 1].style.display = "block"; // הצגת התמונה הנוכחית בהתאם למשתנה הגלובלי שאחראי על מספר התמונה הגדולה 
    // דוגמה- בתחילה הסלייד אינקס שווה 1, אז הוא יציג את התמונה הגדולה את התמונה שנמצאת במיקום ה-0 במערך, כלומר, את התמונה הראשונה

    dots[slideIndex - 1].className += " active"; // cssהוספה של קלאס אקטיב לתמונה הקטנה שמוצגת באותו הרגע, על מנת לעצב אותה ב
    captionText.innerHTML = dots[slideIndex - 1].alt; // הצגת הכותרת של התמונה, בהתאם למיקום שלה במערך, לפי האלט שכתבנו
}
